#! /bin/bash
####################################################
# スクリプト名 : main.sh
# 説明         : 指定された処理を実行するよ
# 引数         : なし
#   $1         : -
# 実行例       : ./main.sh
# 更新日       : YYYY/MM/DD
# 作成者       : takiguchi-yu
####################################################

# 処理1 引数なし
function _func1
{
  echo 
  echo -e "\033[0;32m[INFO]: \033[0;39m"処理1 開始します
  echo -e "\033[0;32m[INFO]: \033[0;39m"処理1 終了します
  echo
}

# 処理2 引数1つ
function _func2
{
  echo 
  echo -e "\033[0;32m[INFO]: \033[0;39m"一つ目の引数
  echo -e "\033[0;32m[INFO]: \033[0;39m"$1
  echo -e "\033[0;32m[INFO]: \033[0;39m"二つ目の引数
  echo -e "\033[0;32m[INFO]: \033[0;39m"$2
  exit 0
}

while :
do
  echo "------------------------------------------------------"
  echo -e "\033[0;34m[1]: \033[0;39m"処理1 を実行します
  echo -e "\033[0;34m[2]: \033[0;39m"処理2 を実行します
  echo -e "\033[0;34m[3]: \033[0;39m"処理3 を実行します
  echo -e "\033[0;31m[q]: シェルを終了します\033[0;39m"
  echo "------------------------------------------------------"
  read -p "番号を選択してください: " buildNum
  case "${buildNum}" in
    "1" ) _func1 ;;
    "2" ) _func2 arg1 arg2 ;;
    "q" ) exit ;;
  esac
done
